// Задача 52. Задайте двумерный массив из целых чисел. Найдите среднее арифметическое элементов в каждом столбце.
// Например, задан массив:
// 1 4 7 2
// 5 9 2 3
// 8 4 2 4
// Среднее арифметическое каждого столбца: 4,6; 5,6; 3,6; 3.

double[,] array = new double[3,4]
{
    {5,8,2,3},
    {4,7,12,3},
    {10,3,8,9},
    
};
double a = (array[0,0] + array[0,1] + array[0,2] + array[0,3]) / 4;
double b = (array[1,0] + array[1,1] + array[1,2] + array[1,3]) / 4;
double c = (array[2,0] + array[2,1] + array[2,2] + array[2,3]) / 4;

Console.WriteLine($"Среднее арифметическое каждого столбца: {a}, {b}, {c}");